blog/hrtf-ladspa.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-24 Mon 18:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spatial Audio:  ALSA Virtual Devices Using LADSPA</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="raman" />
</head>
<body>
<div id="content">
<h1 class="title">Spatial Audio:  ALSA Virtual Devices Using LADSPA</h1>
<div id="outline-container-org6e5a6af" class="outline-2">
<h2 id="org6e5a6af"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
I have long wanted to apply HRTF filters to <a href="https://emacspeak.blogspot.com/2015/12/soundscapes-on-emacspeak-audio-desktop.html">soundscapes</a> on the
Emacspeak Audio Desktop to produce effects that are better
spatialized.  I just got this working over the weekend using LADSPA
Plugin <i>ZamHeadX2-ladspa.so</i> from package <a href="https://github.com/zamaudio/zam-plugins.git">zam-plugins</a>.
</p>
</div>
</div>

<div id="outline-container-org25e9a57" class="outline-2">
<h2 id="org25e9a57"><span class="section-number-2">2</span> Getting ZAM Plugins</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
git clone https://github.com/zamaudio/zam-plugins.git 
</pre>
<p>
And follow the instructions in the  README file.
</p>

<p>
Next,   do 
</p>
<pre class="example">
sudo make install
</pre>
<p>
to install the plugins.
</p>

<p>
Finally, make sure that the install location is on your LADSPA path.
</p>
</div>

<div id="outline-container-org55c948b" class="outline-3">
<h3 id="org55c948b"><span class="section-number-3">2.1</span> Adding HRTF Virtual  Devices Via ASOUNDRC</h3>
<div class="outline-text-3" id="text-2-1">
<p>
After updating Emacspeak from GitHub,
open file <a href="https://github.com/tvraman/emacspeak//blob/2d93e0f92427e4f64064aa75e380fa66bbb87fcf/servers/linux-outloud/asoundrc">servers/linux-outloud/asoundrc</a> 
and copy the section marked <i>HRTF</i> to your personal <span class="underline">.asoundrc</span> &#x2014;
this defines a number of virtual devices that use the newly installed
LADSPA plugin.
<b>Beware</b>: Back-up your <span class="underline">.asoundrc</span> first and make sure you can restore
it even if you lose speech.
</p>
</div>
</div>
</div>

<div id="outline-container-orga3aa9b3" class="outline-2">
<h2 id="orga3aa9b3"><span class="section-number-2">3</span> Spatialized Soundscapes</h2>
<div class="outline-text-2" id="text-3">
<p>
In a running Emacspeak session,  invoke  command 
</p>
<pre class="example">
soundscape-restart
</pre>
<p>
with an interactive prefix arg  and specify one of the available
devices using standard Emacs completion.
</p>

<p>
For use with Soundscapes, I recommend one of the devices that place
sound directly in front of the listener (azimuth 0) but with a non-0
elevation.
</p>

<p>
The HRTF devices are named with prefix <span class="underline">tts</span> because I  would like to
use these with software TTS; but for now the   result with TTS is not
as good as it is with Soundscapes.
</p>

<p>
Notice that command <span class="underline">soundscape-restart</span> offers a number of virtual
ALSA devices based on your <span class="underline">.asoundrc</span>; see the next section for a
summary. 
</p>
</div>
</div>
<div id="outline-container-org8553b23" class="outline-2">
<h2 id="org8553b23"><span class="section-number-2">4</span> Virtual ALSA Devices For Use As A Soundscape Filter</h2>
<div class="outline-text-2" id="text-4">
<p>
Here is a list of available LADSPA devices in my setup that can be
used  to add additional effects to Soundscapes:
</p>

<ul class="org-ul">
<li>crossfeed:  Apply a BS2B filter.</li>
<li>default:  No filters, vanilla audio.</li>
<li>tap-reverb:  Reverb filter from package tap-plugins.</li>
<li>reverb-crossfeed:  Reverb filter followed by BS2B.</li>
<li>tts-a0-e15:  HRTF at (0, 15).</li>
<li>tts-a0-e30:  HRTF at (0, 30).</li>
<li>tts-a0-e60:  HRTF at (0, 60).</li>
<li>tts-a0-e90:  HRTF at (0, 90).</li>
<li>tts-a0-em15:  HRTF at (0, -15).</li>
<li>tts-a0-em30:  HRTF at (0, -30).</li>
<li>tts-a0-em45:  HRTF at (0, -45).</li>
<li>tts-a135-e45:  HRTF at (135, 45).</li>
<li>tts-a135-em45:  HRTF at (135, -45).</li>
<li>tts-a225-e45:  HRTF at (225, 45).</li>
<li>tts-a225-em45:  HRTF at (225, -45).</li>
<li>tts-a45-e45:  HRTF at (45, 45).</li>
<li>tts-a45-em45:  HRTF at (45, -45).</li>
<li>tts-am45-e45:  HRTF at (-45, 45).</li>
<li>tts-am45-em45:  HRTF at (-45, -45).</li>
</ul>
</div>
</div>

<div id="outline-container-org2a41e7f" class="outline-2">
<h2 id="org2a41e7f"><span class="section-number-2">5</span> Other Uses Of HRTF Devices</h2>
<div class="outline-text-2" id="text-5">
<p>
You can experiment with these devices using aplay e.g.:
</p>
<pre class="example">
aplay -Dtts_a0_e0 filename.wav
</pre>

<p>
You can also apply the HRTF Ladspa plugin from within <i>MPlayer</i> when
using emacspeak.
To try this, use <span class="underline">C-e ; f</span> and pick the Zam effect when prompted.
Invoke that command with an interactive prefix arg &#x2014; <span class="underline">C-u C-e ; f</span>
&#x2014; to edit the params passed to the Zam filter.
</p>

<p>
HRTF filters  when  playing media are mostly useful to position a
radio station in 3d space when playing  more than one station
simultaneously.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-07-24 Mon 00:00</p>
<p class="author">Author: raman</p>
<p class="date">Created: 2017-07-24 Mon 18:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
